Revit 2024 API
DirectShape.AreOptionsValidForTransientDirectShape Method
 Validates that the given DirectShapeOptions are allowed if this DirectShape is transient.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool AreOptionsValidForTransientDirectShape(
	DirectShapeOptions options
)
Visual Basic
Public Function AreOptionsValidForTransientDirectShape ( _
	options As DirectShapeOptions _
) As Boolean
Visual C++
public:
bool AreOptionsValidForTransientDirectShape(
	DirectShapeOptions^ options
)
Parameters
options
Type: Autodesk.Revit.DB.DirectShapeOptions
 The options object.
Return Value
 True if the DirectShapeOptions are valid; false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectShape Class
Autodesk.Revit.DB Namespace